Repository: bestxxt/HappyCursor
Catalog: HappyCursor/Resources/*.lproj/Localizable.strings
Languages: de, es, fr, ja, ru

source: Global Cursor Controller
de: Globaler Cursor-Controller
es: Controlador de cursor global
fr: Contrôleur de curseur global
ja: グローバルカーソルコントローラー
ru: Глобальный контроллер курсора

source: Key Status
de: Tastenstatus
es: Estado de teclas
fr: État des touches
ja: キー状態
ru: Состояние клавиш

source: Trigger Hotkey
de: Auslöser-Hotkey
es: Tecla de activación
fr: Raccourci de déclenchement
ja: トリガーホットキー
ru: Клавиша активации

source: Movement Sensitivity
de: Bewegungsempfindlichkeit
es: Sensibilidad de movimiento
fr: Sensibilité de mouvement
ja: 移動感度
ru: Чувствительность движения

source: Horizontal Movement
de: Horizontale Bewegung
es: Movimiento horizontal
fr: Mouvement horizontal
ja: 水平移動
ru: Горизонтальное движение

source: Vertical Movement
de: Vertikale Bewegung
es: Movimiento vertical
fr: Mouvement vertical
ja: 垂直移動
ru: Вертикальное движение

source: Enable Horizontal Movement
de: Horizontale Bewegung aktivieren
es: Activar movimiento horizontal
fr: Activer le mouvement horizontal
ja: 水平移動を有効にする
ru: Включить горизонтальное движение

source: Enable Vertical Movement
de: Vertikale Bewegung aktivieren
es: Activar movimiento vertical
fr: Activer le mouvement vertical
ja: 垂直移動を有効にする
ru: Включить вертикальное движение

source: Word Jump
de: Wortsprung
es: Salto de palabra
fr: Saut de mot
ja: 単語ジャンプ
ru: Прыжок по словам

source: Line Start/End
de: Zeilenanfang/-ende
es: Inicio/Fin de línea
fr: Début/Fin de ligne
ja: 行頭/行末
ru: Начало/Конец строки

source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
ja: 選択
ru: Выбрать

source: Column Start/End
de: Spaltenanfang/-ende
es: Inicio/Fin de columna
fr: Début/Fin de colonne
ja: 列頭/列末
ru: Начало/Конец столбца

source: App Specific Control
de: App-spezifische Steuerung
es: Control específico de aplicación
fr: Contrôle spécifique à l'application
ja: アプリ固有制御
ru: Контроль конкретного приложения

source: Enable cursor control only in selected apps
de: Cursor-Steuerung nur in ausgewählten Apps aktivieren
es: Activar control de cursor solo en aplicaciones seleccionadas
fr: Activer le contrôle du curseur uniquement dans les applications sélectionnées
ja: 選択したアプリでのみカーソル制御を有効にする
ru: Включить контроль курсора только в выбранных приложениях

source: App Whitelist (check to enable)
de: App-Whitelist (aktivieren durch Ankreuzen)
es: Lista blanca de aplicaciones (marcar para activar)
fr: Liste blanche des applications (cocher pour activer)
ja: アプリホワイトリスト（チェックして有効化）
ru: Белый список приложений (отметьте для включения)

source: General Settings
de: Allgemeine Einstellungen
es: Configuración general
fr: Paramètres généraux
ja: 一般設定
ru: Общие настройки

source: Enable Cursor Control
de: Cursor-Steuerung aktivieren
es: Activar control de cursor
fr: Activer le contrôle du curseur
ja: カーソル制御を有効にする
ru: Включить контроль курсора

source: Enable Haptic Feedback
de: Haptisches Feedback aktivieren
es: Activar retroalimentación háptica
fr: Activer le retour haptique
ja: 触覚フィードバックを有効にする
ru: Включить тактильную обратную связь

source: Test Area
de: Testbereich
es: Área de prueba
fr: Zone de test
ja: テストエリア
ru: Тестовая область

source: Welcome to HappyCursor Global Cursor Controller!
de: Willkommen beim HappyCursor Global Cursor Controller!
es: ¡Bienvenido al controlador de cursor global HappyCursor!
fr: Bienvenue dans le contrôleur de curseur global HappyCursor !
ja: HappyCursor グローバルカーソルコントローラーへようこそ！
ru: Добро пожаловать в глобальный контроллер курсора HappyCursor!

source: This is a test area where you can experience cursor movement functionality. Hold the set hotkey (default is Command key) and slide the trackpad, you will see the cursor moving in the text.
de: Dies ist ein Testbereich, in dem Sie die Cursor-Bewegungsfunktionalität erleben können. Halten Sie den eingestellten Hotkey (standardmäßig Command-Taste) gedrückt und gleiten Sie über das Trackpad, Sie werden sehen, wie sich der Cursor im Text bewegt.
es: Esta es un área de prueba donde puedes experimentar la funcionalidad de movimiento del cursor. Mantén presionada la tecla configurada (por defecto la tecla Command) y desliza el trackpad, verás el cursor moviéndose en el texto.
fr: Ceci est une zone de test où vous pouvez expérimenter la fonctionnalité de mouvement du curseur. Maintenez le raccourci défini (par défaut la touche Command) et glissez sur le trackpad, vous verrez le curseur se déplacer dans le texte.
ja: これはカーソル移動機能を体験できるテストエリアです。設定されたホットキー（デフォルトはCommandキー）を押しながらトラックパッドをスライドすると、テキスト内でカーソルが移動するのを確認できます。
ru: Это тестовая область, где вы можете испытать функциональность движения курсора. Удерживайте установленную горячую клавишу (по умолчанию клавиша Command) и проведите по трекпаду, вы увидите, как курсор движется в тексте.

source: Instructions
de: Anweisungen
es: Instrucciones
ja: 使用説明
ru: Инструкции

source: Hold the set hotkey
de: Halten Sie den eingestellten Hotkey
es: Mantén presionada la tecla configurada
fr: Maintenez le raccourci défini
ja: 設定されたホットキーを押す
ru: Удерживайте установленную горячую клавишу

source: Slide trackpad to move cursor
de: Gleiten Sie über das Trackpad, um den Cursor zu bewegen
es: Desliza el trackpad para mover el cursor
fr: Glissez sur le trackpad pour déplacer le curseur
ja: トラックパッドをスライドしてカーソルを移動
ru: Проведите по трекпаду для перемещения курсора

source: Haptic feedback on each movement
de: Haptisches Feedback bei jeder Bewegung
es: Retroalimentación háptica en cada movimiento
fr: Retour haptique à chaque mouvement
ja: 各移動で触覚フィードバック
ru: Тактильная обратная связь при каждом движении

source: Requires authorization in System Settings > Accessibility
de: Erfordert Autorisierung in Systemeinstellungen > Barrierefreiheit
es: Requiere autorización en Configuración del sistema > Accesibilidad
fr: Nécessite une autorisation dans Paramètres système > Accessibilité
ja: システム設定 > アクセシビリティでの認証が必要
ru: Требуется авторизация в Системных настройках > Доступность

source: Reset to Default
de: Auf Standard zurücksetzen
es: Restablecer por defecto
fr: Réinitialiser par défaut
ja: デフォルトにリセット
ru: Сбросить по умолчанию

source: Upgrade to Pro
de: Auf Pro upgraden
es: Actualizar a Pro
fr: Passer à Pro
ja: Proにアップグレード
ru: Обновить до Pro

source: Error
de: Fehler
fr: Erreur
ja: エラー
ru: Ошибка

source: Reset to default configuration
de: Standardkonfiguration wiederherstellen
es: Restablecer configuración por defecto
fr: Réinitialiser la configuration par défaut
ja: デフォルト設定にリセット
ru: Сбросить конфигурацию по умолчанию

source: Hotkey
es: Tecla de acceso rápido
fr: Raccourci
ja: ホットキー
ru: Горячая клавиша

source: Disable Cursor Control
de: Cursor-Steuerung deaktivieren
es: Desactivar control de cursor
fr: Désactiver le contrôle du curseur
ja: カーソル制御を無効にする
ru: Отключить контроль курсора

source: Disable Haptic Feedback
de: Haptisches Feedback deaktivieren
es: Desactivar retroalimentación háptica
fr: Désactiver le retour haptique
ja: 触覚フィードバックを無効にする
ru: Отключить тактильную обратную связь

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
ja: 設定
ru: Настройки

source: About HappyCursor
de: Über HappyCursor
es: Acerca de HappyCursor
fr: À propos de HappyCursor
ja: HappyCursorについて
ru: О HappyCursor

source: Quit
de: Beenden
es: Salir
fr: Quitter
ja: 終了
ru: Выйти

# AboutText
source: Global Cursor Controller Version 1.2.0 Make your text editing experience smoother and more efficient!
de: Globaler Cursor-Controller Version 1.2.0 Machen Sie Ihre Texterfahrung flüssiger und effizienter!
es: Controlador de cursor global Versión 1.2.0 ¡Haz tu experiencia de edición de texto más fluida y eficiente!
fr: Contrôleur de curseur global Version 1.2.0 Rendez votre expérience d'édition de texte plus fluide et efficace !
ja: グローバルカーソルコントローラー バージョン 1.2.0 テキスト編集体験をよりスムーズで効率的に！
ru: Глобальный контроллер курсора Версия 1.2.0 Сделайте ваш опыт редактирования текста более плавным и эффективным!

source: Accessibility permission required
de: Barrierefreiheit-Berechtigung erforderlich
es: Se requiere permiso de accesibilidad
fr: Permission d'accessibilité requise
ja: アクセシビリティ権限が必要です
ru: Требуется разрешение на доступность

source: To allow HappyCursor to control the cursor globally, please grant Accessibility permission in System Settings.
de: Damit HappyCursor den Cursor global steuern kann, gewähren Sie bitte die Barrierefreiheit-Berechtigung in den Systemeinstellungen.
es: Para permitir que HappyCursor controle el cursor globalmente, por favor otorga el permiso de accesibilidad en la configuración del sistema.
fr: Pour permettre à HappyCursor de contrôler le curseur globalement, veuillez accorder la permission d'accessibilité dans les paramètres système.
ja: HappyCursorがグローバルにカーソルを制御できるように、 システム設定でアクセシビリティ権限を付与してください。
ru: Чтобы позволить HappyCursor глобально управлять курсором, пожалуйста, предоставьте разрешение на доступность в системных настройках.

source: Open System Settings
de: Systemeinstellungen öffnen
es: Abrir configuración del sistema
fr: Ouvrir les paramètres système
ja: システム設定を開く
ru: Открыть системные настройки

source: After authorization, you may need to restart HappyCursor for all features to take effect.
de: Nach der Autorisierung müssen Sie HappyCursor möglicherweise neu starten, damit alle Funktionen wirksam werden.
es: Después de la autorización, es posible que necesites reiniciar HappyCursor para que todas las funciones surtan efecto.
fr: Après l'autorisation, vous devrez peut-être redémarrer HappyCursor pour que toutes les fonctionnalités prennent effet.
ja: 認証後、すべての機能を有効にするためにHappyCursorを再起動する必要がある場合があります。
ru: После авторизации вам может потребоваться перезапустить HappyCursor, чтобы все функции вступили в силу.
